Sparkleiot/BK7239N_AT/middleware/soc/bk7236/hal/sys_hal.c
	return 0;
}

int sys_hal_rosc_calibration(uint32_t rosc_cali_mode, uint32_t cali_interval)
{
	sys_ll_set_ana_reg6_manu_ena(0);
	sys_ll_set_ana_reg6_modifi_auto(0);
	sys_ll_set_ana_reg6_calib_auto(0);
	sys_ll_set_ana_reg6_spi_trig(0);

	if (rosc_cali_mode == 0) { //Auto
		sys_ll_set_ana_reg6_cal_mode(1);
		sys_ll_set_ana_reg6_calib_auto(1);
		sys_ll_set_ana_reg6_xtal_wakeup_time(8);
		sys_ll_set_ana_reg6_calib_interval(cali_interval);
		sys_ll_set_ana_reg6_spi_trig(1);
	} else if (rosc_cali_mode == 1) { //Manual
		sys_ll_set_ana_reg6_manu_cin(cali_interval);
		sys_ll_set_ana_reg6_calib_interval(cali_interval >> 16);
		sys_ll_set_ana_reg6_manu_ena(1);
	} else if (rosc_cali_mode == 2) { //Modify
		sys_ll_set_ana_reg6_cal_mode(1);
		sys_ll_set_ana_reg6_modifi_auto(1);
		sys_ll_set_ana_reg6_xtal_wakeup_time(8);
		sys_ll_set_ana_reg6_modify_interval(cali_interval);
		sys_ll_set_ana_reg6_spi_trig(1);
	} else if (rosc_cali_mode == 3) { //Trigger
		sys_ll_set_ana_reg6_cal_mode(1);
		sys_ll_set_ana_reg6_spi_trig(1);
	} else { //Disable
	}

	return BK_OK;
}

int sys_hal_rosc_test_mode(bool enabled)
{
	if (enabled) {
		sys_ll_set_ana_reg4_ck_tst_enbale(1);
		sys_ll_set_ana_reg4_cktst_sel(0);
		sys_ll_set_ana_reg5_rosc_tsten(1);
		sys_ll_set_ana_reg6_cal_mode(1);
		//sys_ll_set_ana_reg6_calib_auto(0);
		//sys_ll_set_ana_reg6_calib_auto(1);
		REG_WRITE((SOC_AON_GPIO_REG_BASE + (24 << 2)), 0x40);
	} else {
		sys_ll_set_ana_reg4_ck_tst_enbale(0);
		sys_ll_set_ana_reg4_cktst_sel(0);
		sys_ll_set_ana_reg5_rosc_tsten(0);
		sys_ll_set_ana_reg6_cal_mode(0);
		sys_ll_set_ana_reg6_calib_auto(0);
	}
	return BK_OK;
}

void sys_hal_module_RF_power_ctrl (module_name_t module,power_module_state_t power_state)
{
    uint32_t value = 0;
	value = sys_ll_get_ana_reg6_value();
    if(power_state == POWER_MODULE_STATE_ON)//power on
    {
		//value |= ((1 << SYS_ANA_REG6_EN_SYSLDO_POS)|(1 << SYS_ANA_REG6_EN_DPLL_POS)|(1 << SYS_ANA_REG6_EN_TEMPDET_POS));//en_sysldo,en_dpll
		//value &= ~(1 << SYS_ANA_REG6_XTAL_LPMODE_CTRL_POS);//when using the xtal as the 32k,it need close the xtal low power mode
		//value |= (1 << 11);//en_audpll //temp close,we will open when be neeeded
		//value |= (1 << 8);//en_dco     //now no module using,temp close,we will open when be neeeded
		//value |= (1 << 7);//en_xtall   //now no module using,temp close,we will open when be neeeded
    }
	else //power down
	{
		value &= ~(1 << 12);//en_dpll
		value &= ~(1 << 11);//en_audpll
		value &= ~(1 << 8);//en_dco
		value &= ~(1 << 7);//en_xtall
	}

	sys_ll_set_ana_reg6_value(value);

}

void sys_hal_cpu0_main_int_ctrl(dev_clk_pwr_ctrl_t clock_state)
{
    sys_ll_set_cpu0_int_halt_clk_op_cpu0_int_mask( clock_state);
}

void sys_hal_cpu1_main_int_ctrl(dev_clk_pwr_ctrl_t clock_state)
{
    sys_ll_set_cpu1_int_halt_clk_op_cpu1_int_mask( clock_state);
}

void sys_hal_set_cpu1_boot_address_offset(uint32_t address_offset)
{
    sys_ll_set_cpu1_int_halt_clk_op_cpu1_offset(address_offset);
}

void sys_hal_set_cpu2_boot_address_offset(uint32_t address_offset)
{
    sys_ll_set_cpu2_int_halt_clk_op_cpu2_offset(address_offset);
}

void sys_hal_set_cpu1_reset(uint32_t reset_value)
{
    /*1:reset ; 0:not reset*/
    sys_ll_set_cpu1_int_halt_clk_op_cpu1_sw_rst(reset_value);
}

void sys_hal_set_cpu2_reset(uint32_t reset_value)
{
    /*1:reset ; 0:not reset*/
    sys_ll_set_cpu2_int_halt_clk_op_cpu2_sw_rst(reset_value);
}

void sys_hal_all_modules_clk_div_set(clk_div_reg_e reg, uint32_t value)
{
    clk_div_address_map_t clk_div_address_map_table[] = CLK_DIV_ADDRESS_MAP;
    clk_div_address_map_t *clk_div_addr = &clk_div_address_map_table[reg];

    uint32_t clk_div_reg_address = clk_div_addr->reg_address;

	REG_WRITE(clk_div_reg_address, value);
}

uint32_t sys_hal_all_modules_clk_div_get(clk_div_reg_e reg)
{
    clk_div_address_map_t clk_div_address_map_table[] = CLK_DIV_ADDRESS_MAP;
    clk_div_address_map_t *clk_div_addr = &clk_div_address_map_table[reg];

	 uint32_t clk_div_reg_address = clk_div_addr->reg_address;

	return REG_READ(clk_div_reg_address);
}

void sys_hal_cpu_clk_div_set(uint32_t core_index, uint32_t value)
{
	if(core_index == 0)//cpu0
	{
		sys_ll_set_cpu0_int_halt_clk_op_cpu0_speed(value);
	}
	else if(core_index == 1)//cpu1
	{
		sys_ll_set_cpu1_int_halt_clk_op_cpu1_speed(value);
	}
	else if(core_index == 2)//cpu2
	{
		sys_ll_set_cpu2_int_halt_clk_op_cpu2_speed(value);
	}
}
uint32_t sys_hal_cpu_clk_div_get(uint32_t core_index)
{
	uint32_t value = 2;
	if(core_index == 0)//cpu0
	{
		value = sys_ll_get_cpu0_int_halt_clk_op_cpu0_speed();
	}
	else if(core_index == 1)//cpu1
	{
		value = sys_ll_get_cpu1_int_halt_clk_op_cpu1_speed();
	}
	else if(core_index == 2)//cpu2
	{
		value = sys_ll_get_cpu2_int_halt_clk_op_cpu2_speed();
	}
	return value;
}

int32 sys_hal_lp_vol_set(uint32_t value)
{
	sys_ll_set_ana_reg9_spi_latch1v(1);
	sys_ll_set_ana_reg9_vcorelsel(value);
	sys_ll_set_ana_reg9_spi_latch1v(0);

	return 0;
}

uint32_t sys_hal_lp_vol_get()
{
	return sys_ll_get_ana_reg9_vcorelsel();
}
int32 sys_hal_rf_tx_vol_set(uint32_t value)
{
	sys_ll_set_ana_reg9_spi_latch1v(1);
	sys_ll_set_ana_reg8_t_vanaldosel(value);
	sys_ll_set_ana_reg9_spi_latch1v(0);
	return 0;
}
uint32_t sys_hal_rf_tx_vol_get()
{
	return sys_ll_get_ana_reg8_t_vanaldosel();
}
int32 sys_hal_rf_rx_vol_set(uint32_t value)
{
	sys_ll_set_ana_reg9_spi_latch1v(1);
	sys_ll_set_ana_reg8_r_vanaldosel(value);
	sys_ll_set_ana_reg9_spi_latch1v(0);
	return 0;
}
uint32_t sys_hal_rf_rx_vol_get()
{
	return sys_ll_get_ana_reg8_r_vanaldosel();
}
int32 sys_hal_bandgap_cali_set(uint32_t value)//increase or decrease the dvdddig voltage
{
	return 0;
}
uint32_t sys_hal_bandgap_cali_get()
{
	return 0;
}
bk_err_t sys_hal_core_bus_clock_ctrl(uint32_t cksel_core, uint32_t ckdiv_core,uint32_t ckdiv_bus, uint32_t ckdiv_cpu0,uint32_t ckdiv_cpu1)
{
	uint32_t clk_param  = 0;
	uint32_t     h_vol  = 0;
	if(cksel_core > 3)
	{
		os_printf("set dvfs cksel core > 3 invalid %d\r\n",cksel_core);
		return BK_FAIL;
	}

	if((ckdiv_core > PM_FREQUNCY_DIV_MAX) || (ckdiv_bus > PM_FREQUNCY_DIV_BUS_MAX)||(ckdiv_cpu1 > PM_FREQUNCY_DIV_CPU_MAX)||(ckdiv_cpu0 > PM_FREQUNCY_DIV_CPU_MAX))
	{
		os_printf("set dvfs ckdiv_core ckdiv_bus ckdiv_cpu0_1  ckdiv_cpu0_1  > 1 invalid\r\n");
		return BK_FAIL;
	}
	if((cksel_core == PM_CLKSEL_CORE_320M)&&(ckdiv_core == PM_CLKDIV_CORE_0)&&(ckdiv_cpu0 != PM_CLKDV_CPU0_0))
	{
		os_printf("unsupport the cpu freq setting %d %d %d\r\n",cksel_core,ckdiv_core,ckdiv_cpu0);
		return BK_FAIL;
	}

