Sparkleiot/BK7239N_AT/middleware/soc/bk7236/hal/sys_hal.c
	if((cksel_core == PM_CLKSEL_CORE_320M)&&(ckdiv_core == PM_CLKDIV_CORE_0))
	{
		h_vol = sys_hal_vdddig_h_vol_get();
		if(h_vol < PM_VDDDIG_H_VOL_0v9)
		{
			sys_hal_ctrl_vddd_h_vol(PM_VDDD_H_VOL_1V);
			sys_hal_ctrl_vdddig_h_vol(PM_VDDDIG_H_VOL_0v9);
		}
	}
	clk_param = 0;
	clk_param = sys_hal_all_modules_clk_div_get(CLK_DIV_REG0);
	if(((clk_param >> 0x4)&0x3) > cksel_core)//when it from the higher frequency to lower frequency
	{
		/*1.core clk select*/
		clk_param = 0;
		clk_param = sys_hal_all_modules_clk_div_get(CLK_DIV_REG0);
		clk_param &=  ~(0x3 << 4);
		clk_param |=  cksel_core << 4;
		sys_hal_all_modules_clk_div_set(CLK_DIV_REG0,clk_param);

		/*2.config bus and core clk div*/
		clk_param = 0;
		clk_param = sys_hal_all_modules_clk_div_get(CLK_DIV_REG0);
		clk_param &=  ~(0xF << 0);
		clk_param |=  ckdiv_core << 0;
		sys_hal_all_modules_clk_div_set(CLK_DIV_REG0,clk_param);

		/*3.config cpu clk div*/
		sys_hal_cpu_clk_div_set(0,ckdiv_cpu0);
		sys_hal_cpu_clk_div_set(1,ckdiv_cpu1);
		sys_hal_cpu_clk_div_set(2,1);//config cpu2
	}
	else//when it from the lower frequency to higher frequency
	{
		/*1.config bus and core clk div*/
		if(ckdiv_core == 0)
		{
			sys_hal_cpu_clk_div_set(0,ckdiv_cpu0);//avoid the bus freq > 240m
		}

		clk_param = 0;
		clk_param = sys_hal_all_modules_clk_div_get(CLK_DIV_REG0);
		clk_param &=  ~(0xF << 0);
		clk_param |=  ckdiv_core << 0;
		sys_hal_all_modules_clk_div_set(CLK_DIV_REG0,clk_param);

		/*2.config cpu clk div*/
		if(ckdiv_core != 0)
		{
			sys_hal_cpu_clk_div_set(0,ckdiv_cpu0);
		}
		sys_hal_cpu_clk_div_set(1,ckdiv_cpu1);
		sys_hal_cpu_clk_div_set(2,1);//config cpu2

		/*3.core clk select*/

		clk_param = 0;
		clk_param = sys_hal_all_modules_clk_div_get(CLK_DIV_REG0);
		clk_param &=  ~(0x3 << 4);
		clk_param |=  cksel_core << 4;
		sys_hal_all_modules_clk_div_set(CLK_DIV_REG0,clk_param);
	}

	return BK_OK;
}

bk_err_t sys_hal_ctrl_vddd_h_vol(uint32_t vol_value)
{
#if CONFIG_RX_OPTIMIZE
	if(sys_ll_get_ana_reg9_vdighsel() != vol_value)
	{
		sys_ll_set_ana_reg9_spi_latch1v(1);
		sys_ll_set_ana_reg9_vdighsel(vol_value);
		sys_ll_set_ana_reg9_spi_latch1v(0);
		sys_hal_delay(SYS_SWITCH_VDDDIG_VOL_DELAY_TIME);//when cpu0 max freq 240m ,it delay 10uS for voltage stability
	}
#endif
	return BK_OK;
}

bk_err_t sys_hal_ctrl_vdddig_h_vol(uint32_t vol_value)
{
	if(sys_ll_get_ana_reg9_vcorehsel() != vol_value)
	{
		sys_ll_set_ana_reg9_spi_latch1v(1);
		sys_ll_set_ana_reg9_vcorehsel(vol_value);
		sys_ll_set_ana_reg9_spi_latch1v(0);
		sys_hal_delay(SYS_SWITCH_VDDDIG_VOL_DELAY_TIME);//when cpu0 max freq 240m ,it delay 10uS for voltage stability
	}

	return BK_OK;
}

uint32_t sys_hal_vdddig_h_vol_get()
{
	return sys_ll_get_ana_reg9_vcorehsel();
}
bk_err_t sys_hal_switch_cpu_bus_freq_high_to_low(pm_cpu_freq_e cpu_bus_freq)
{
	bk_err_t ret = BK_OK;
	switch(cpu_bus_freq)
	{
		case PM_CPU_FRQ_480M://cpu0:240m;cpu1:480m;cpu2:480m;bus:240m
			ret = sys_hal_core_bus_clock_ctrl(0x3,0x0,0x0,0x0,0x1);
#if	CONFIG_DO_MIPS_FUNCTION
			os_printf("high-to-low \r\n");
			sys_hal_ctrl_vddd_h_vol(0x7);	// 1.05v
			sys_hal_ctrl_vdddig_h_vol(0xB);	//0.875V basic_vol:0.6v scale:0.025v
#else
			sys_hal_ctrl_vddd_h_vol(0x7);//  1.05v
			sys_hal_ctrl_vdddig_h_vol(0xE);//0.95V
#endif
			break;
		case PM_CPU_FRQ_320M://cpu0:160m;cpu1:320m;cpu2:320m;bus:160m
		    ret = sys_hal_core_bus_clock_ctrl(0x2,0x0,0x0,0x0,0x1);
			sys_hal_ctrl_vddd_h_vol(0x7);// 1.05 v
			sys_hal_ctrl_vdddig_h_vol(0xD);//0.925V

			break;
		case PM_CPU_FRQ_240M://cpu0:240m;cpu1:240m;;cpu2:240m;bus:240m
			ret = sys_hal_core_bus_clock_ctrl(0x3,0x1,0x0,0x1,0x1);
			sys_hal_ctrl_vddd_h_vol(0x6);// 1.0 v
			sys_hal_ctrl_vdddig_h_vol(0xD);//0.925V

			break;
		case PM_CPU_FRQ_120M://cpu0:120m;cpu1:120m;cpu2:120m;bus:120m
#if CONFIG_DCO_CLK_ENABLE
			ret = sys_hal_core_bus_clock_ctrl(0x1,0x1,0x0,0x1,0x1);
#else
			ret = sys_hal_core_bus_clock_ctrl(0x3,0x3,0x0,0x1,0x1);
#endif
			sys_hal_ctrl_vddd_h_vol(0x6);// 1.0V
			#if CONFIG_ATE_TEST
			sys_hal_ctrl_vdddig_h_vol(0x7);//0.775V
			#else
			sys_hal_ctrl_vdddig_h_vol(0xC);//0.9V
			#endif

			break;
		case PM_CPU_FRQ_80M://cpu0:80m;cpu1:80m;cpu2:80m;bus:80m
#if CONFIG_DCO_CLK_ENABLE
			ret = sys_hal_core_bus_clock_ctrl(0x1,0x2,0x0,0x1,0x1);
#else
			ret = sys_hal_core_bus_clock_ctrl(0x3,0x5,0x0,0x1,0x1);
#endif
			sys_hal_ctrl_vddd_h_vol(0x6);// 1.0V
			sys_hal_ctrl_vdddig_h_vol(0xB);//0.875V

			break;
		case PM_CPU_FRQ_60M://cpu0:60m;cpu1:60m;cpu2:60m;bus:60m
#if CONFIG_DCO_CLK_ENABLE
			ret = sys_hal_core_bus_clock_ctrl(0x1,0x3,0x0,0x1,0x1);
#else
			ret = sys_hal_core_bus_clock_ctrl(0x3,0x7,0x0,0x1,0x1);
#endif
			sys_hal_ctrl_vddd_h_vol(0x6);// 1.0V
			sys_hal_ctrl_vdddig_h_vol(0xB);//0.875V
			break;
		case PM_CPU_FRQ_XTAL://cpu0:26m;cpu1:26m;cpu2:26m;bus:26m
			ret = sys_hal_core_bus_clock_ctrl(0x0,0x0,0x0,0x1,0x1);
			sys_hal_ctrl_vddd_h_vol(0x6);// 1.0V
			sys_hal_ctrl_vdddig_h_vol(0xB);//0.875V
			break;
		default:
			break;
	}

	return ret;
}
bk_err_t sys_hal_switch_cpu_bus_freq_low_to_high(pm_cpu_freq_e cpu_bus_freq)
{
	bk_err_t ret = BK_OK;
	switch(cpu_bus_freq)
	{
		case PM_CPU_FRQ_480M://cpu0:240m;cpu1:480m;cpu2:480m;bus:240m
#if	CONFIG_DO_MIPS_FUNCTION
			os_printf("low-to-high \r\n");
			sys_hal_ctrl_vddd_h_vol(0x7);// 1.05v
			sys_hal_ctrl_vdddig_h_vol(0xB);//0.875V  //basic_vol:0.6v scale:0.025v
#else
			sys_hal_ctrl_vddd_h_vol(0x7);// 1.05v
			sys_hal_ctrl_vdddig_h_vol(0xE);//0.95V
#endif
			ret = sys_hal_core_bus_clock_ctrl(0x3,0x0,0x0,0x0,0x1);
			break;
		case PM_CPU_FRQ_320M://cpu0:160m;cpu1:320m;cpu2:320m;bus:160m
			sys_hal_ctrl_vddd_h_vol(0x7);// 1.05v
			sys_hal_ctrl_vdddig_h_vol(0xD);//0.925V
			ret = sys_hal_core_bus_clock_ctrl(0x2,0x0,0x0,0x0,0x1);
			break;
		case PM_CPU_FRQ_240M://cpu0:240m;cpu1:240m;;cpu2:240m;bus:240m
			sys_hal_ctrl_vddd_h_vol(0x6);// 1.0v
			sys_hal_ctrl_vdddig_h_vol(0xD);//0.925V
			ret = sys_hal_core_bus_clock_ctrl(0x3,0x1,0x0,0x1,0x1);
			break;
		case PM_CPU_FRQ_120M://cpu0:120m;cpu1:120m;cpu2:120m;bus:120m
			sys_hal_ctrl_vddd_h_vol(0x6);// 1.0V
			sys_hal_ctrl_vdddig_h_vol(0xC);//0.9V
#if CONFIG_DCO_CLK_ENABLE
			ret = sys_hal_core_bus_clock_ctrl(0x1,0x1,0x0,0x1,0x1);
#else
			ret = sys_hal_core_bus_clock_ctrl(0x3,0x3,0x0,0x1,0x1);
#endif
			break;
		case PM_CPU_FRQ_80M://cpu0:80m;cpu1:80m;cpu2:80m;bus:80m
			sys_hal_ctrl_vddd_h_vol(0x6);// 1.0V
			sys_hal_ctrl_vdddig_h_vol(0xB);//0.875V
#if CONFIG_DCO_CLK_ENABLE
			ret = sys_hal_core_bus_clock_ctrl(0x1,0x2,0x0,0x1,0x1);
#else
			ret = sys_hal_core_bus_clock_ctrl(0x3,0x5,0x0,0x1,0x1);
#endif
			break;
		case PM_CPU_FRQ_60M://cpu0:60m;cpu1:60m;cpu2:60m;bus:60m
			sys_hal_ctrl_vddd_h_vol(0x6);// 1.0V
			sys_hal_ctrl_vdddig_h_vol(0xB);//0.875V
#if CONFIG_DCO_CLK_ENABLE
			ret = sys_hal_core_bus_clock_ctrl(0x1,0x3,0x0,0x1,0x1);
#else
			ret = sys_hal_core_bus_clock_ctrl(0x3,0x7,0x0,0x1,0x1);
#endif
			break;
		case PM_CPU_FRQ_XTAL://cpu0:26m;cpu1:26m;cpu2:26m;bus:26m
			sys_hal_ctrl_vddd_h_vol(0x6);// 1.0V
			sys_hal_ctrl_vdddig_h_vol(0xB);//0.875V
			ret = sys_hal_core_bus_clock_ctrl(0x0,0x0,0x0,0x1,0x1);
			break;
		default:
			break;
	}
	return ret;
}
static pm_cpu_freq_e s_pre_cpu_freq = PM_CPU_FRQ_120M;
bk_err_t sys_hal_switch_cpu_bus_freq(pm_cpu_freq_e cpu_bus_freq)
{
	bk_err_t ret = BK_OK;

