Sparkleiot/BK7239N_AT/middleware/soc/bk7236/hal/sys_hal.c
	pm_cpu_freq_e prev_freq = s_pre_cpu_freq;

	if(prev_freq == cpu_bus_freq)
		return BK_OK;

	if(prev_freq > cpu_bus_freq)// eg: 480->60
	{
		sys_hal_switch_cpu_bus_freq_high_to_low(cpu_bus_freq);
	}
	else // eg: 60-480
	{
		sys_hal_switch_cpu_bus_freq_low_to_high(cpu_bus_freq);
	}
	s_pre_cpu_freq = cpu_bus_freq;
	return ret;
}
bk_err_t sys_hal_cpu_freq_dump()
{
	uint32_t value_8 = 0;
	uint32_t value_4 = 0;
	//uint32_t value_5 = 0;
	uint32_t cp0_div = 0;
	//uint32_t cp1_div = 0;
	value_8 = REG_READ(PM_SYS_REG_0x8);
	value_4 = REG_READ(PM_SYS_REG_0x4);

	if(((value_4>>4)&0x1) == 0x1)
	{
		cp0_div = (value_8&0xF)+1;
	}
	else
	{
		cp0_div = ((value_8&0xF)+1)*2;
	}

	switch((value_8 >> PM_CPU_SRC_POS)&PM_CPU_SRC_MASK)
	{
		case PM_CLKSEL_CORE_480M:
			LOGI("Cur freq: CPU0:(480/%d)M\r\n",cp0_div);
			break;
		default:
			break;
	}
	LOGI("freq_reg:0x%x,0x%x\r\n",value_8,value_4);
	return BK_OK;
}
/*for low power function end*/
/*sleep feature end*/

uint32 sys_hal_get_chip_id(void)
{
	return sys_ll_get_version_id_versionid();
}

uint32 sys_hal_get_device_id(void)
{
	return sys_ll_get_device_id_deviceid();
}

__IRAM_SEC int32 sys_hal_int_disable(uint32 param) //CMD_ICU_INT_DISABLE
{
	uint32 reg = 0;
	uint32 value = 0;

#if CONFIG_SYS_CPU0
	reg = sys_ll_get_cpu0_int_0_31_en_value();
	value = reg;
	reg &= ~(param);
	sys_ll_set_cpu0_int_0_31_en_value(reg);
#else
	reg = sys_ll_get_cpu1_int_0_31_en_value();
	value = reg;
	reg &= ~(param);
	sys_ll_set_cpu1_int_0_31_en_value(reg);
#endif

	return value;
}

__IRAM_SEC int32 sys_hal_int_enable(uint32 param) //CMD_ICU_INT_ENABLE
{
	uint32 reg = 0;

#if CONFIG_SYS_CPU0
	reg = sys_ll_get_cpu0_int_0_31_en_value();
	reg |= (param);
	sys_ll_set_cpu0_int_0_31_en_value(reg);
#else
	reg = sys_ll_get_cpu1_int_0_31_en_value();
	reg |= (param);
	sys_ll_set_cpu1_int_0_31_en_value(reg);
#endif

	return 0;
}

//NOTICE:Temp add for BK7256 product which has more then 32 Interrupt sources
__IRAM_SEC int32 sys_hal_int_group2_disable(uint32 param)
{
	uint32 reg = 0;
	uint32 value = 0;

#if CONFIG_SYS_CPU0
	reg = sys_ll_get_cpu0_int_32_63_en_value();
	value = reg;
	reg &= ~(param);
	sys_ll_set_cpu0_int_32_63_en_value(reg);
#else
	reg = sys_ll_get_cpu1_int_32_63_en_value();
	value = reg;
	reg &= ~(param);
	sys_ll_set_cpu1_int_32_63_en_value(reg);
#endif

	return value;
}

//NOTICE:Temp add for BK7256 product which has more then 32 Interrupt sources
__IRAM_SEC int32 sys_hal_int_group2_enable(uint32 param)
{
	uint32 reg = 0;

#if CONFIG_SYS_CPU0
	reg = sys_ll_get_cpu0_int_32_63_en_value();
	reg |= (param);
	sys_ll_set_cpu0_int_32_63_en_value(reg);
#else
	reg = sys_ll_get_cpu1_int_32_63_en_value();
	reg |= (param);
	sys_ll_set_cpu1_int_32_63_en_value(reg);
#endif

	return 0;
}

#if CONFIG_SOC_BK7236_SMP_TEMP
int32 sys_hal_core_int_group1_disable(uint32 core_id, uint32 param)
{
	uint32 reg = 0;
	uint32 value = 0;

	if(CPU0_CORE_ID == core_id){
		reg = sys_ll_get_cpu0_int_0_31_en_value();
		value = reg;
		reg &= ~(param);
		sys_ll_set_cpu0_int_0_31_en_value(reg);
	}
	else if(CPU1_CORE_ID == core_id){
		reg = sys_ll_get_cpu1_int_0_31_en_value();
		value = reg;
		reg &= ~(param);
		sys_ll_set_cpu1_int_0_31_en_value(reg);
	}
	else if(CPU2_CORE_ID == core_id){
		reg = sys_ll_get_cpu2_int_0_31_en_value();
		value = reg;
		reg &= ~(param);
		sys_ll_set_cpu2_int_0_31_en_value(reg);
	}

	return value;
}

int32 sys_hal_core_int_group1_enable(uint32 core_id, uint32 param)
{
	uint32 reg = 0;

	if(CPU0_CORE_ID == core_id){
		reg = sys_ll_get_cpu0_int_0_31_en_value();
		reg |= (param);
		sys_ll_set_cpu0_int_0_31_en_value(reg);
	}
	else if(CPU1_CORE_ID == core_id){
		reg = sys_ll_get_cpu1_int_0_31_en_value();
		reg |= (param);
		sys_ll_set_cpu1_int_0_31_en_value(reg);
	}
	else if(CPU2_CORE_ID == core_id){
		reg = sys_ll_get_cpu2_int_0_31_en_value();
		reg |= (param);
		sys_ll_set_cpu2_int_0_31_en_value(reg);
	}

	return 0;
}

int32 sys_hal_core_int_group2_disable(uint32 core_id, uint32 param)
{
	uint32 reg = 0;
	uint32 value = 0;

	if(CPU0_CORE_ID == core_id){
		reg = sys_ll_get_cpu0_int_32_63_en_value();
		value = reg;
		reg &= ~(param);
		sys_ll_set_cpu0_int_32_63_en_value(reg);
	}
	else if(CPU1_CORE_ID == core_id){
		reg = sys_ll_get_cpu1_int_32_63_en_value();
		value = reg;
		reg &= ~(param);
		sys_ll_set_cpu1_int_32_63_en_value(reg);
	}
	else if(CPU2_CORE_ID == core_id){
		reg = sys_ll_get_cpu2_int_32_63_en_value();
		value = reg;
		reg &= ~(param);
		sys_ll_set_cpu2_int_32_63_en_value(reg);
	}

	return value;
}

int32 sys_hal_core_int_group2_enable(uint32 core_id, uint32 param)
{
	uint32 reg = 0;

	if(CPU0_CORE_ID == core_id){
		reg = sys_ll_get_cpu0_int_32_63_en_value();
		reg |= (param);
		sys_ll_set_cpu0_int_32_63_en_value(reg);
	}
	else if(CPU1_CORE_ID == core_id){
		reg = sys_ll_get_cpu1_int_32_63_en_value();
		reg |= (param);
		sys_ll_set_cpu1_int_32_63_en_value(reg);
	}
	else if(CPU2_CORE_ID == core_id){
		reg = sys_ll_get_cpu2_int_32_63_en_value();
		reg |= (param);
		sys_ll_set_cpu2_int_32_63_en_value(reg);
	}

	return 0;
}
#endif

int32 sys_hal_fiq_disable(uint32 param)
{
	uint32 reg = 0;
	uint32 value = 0;

#if CONFIG_SYS_CPU0
	reg = sys_ll_get_cpu0_int_32_63_en_value();
	value = reg;
	reg &= ~(param);
	sys_ll_set_cpu0_int_32_63_en_value(reg);
#else
	reg = sys_ll_get_cpu1_int_32_63_en_value();
	value = reg;
	reg &= ~(param);
	sys_ll_set_cpu1_int_32_63_en_value(reg);
#endif

	return value;
}

int32 sys_hal_fiq_enable(uint32 param)
{
	uint32 reg = 0;

#if CONFIG_SYS_CPU0
	reg = sys_ll_get_cpu0_int_32_63_en_value();
	reg |= (param);
	sys_ll_set_cpu0_int_32_63_en_value(reg);
#else
	reg = sys_ll_get_cpu1_int_32_63_en_value();
	reg |= (param);
	sys_ll_set_cpu1_int_32_63_en_value(reg);
#endif

	return 0;
}

//	GLOBAL_INT_DECLARATION();	GLOBAL_INT_DISABLE();
int32 sys_hal_global_int_disable(uint32 param)
{
	int32 ret = 0;

	return ret;
}

// GLOBAL_INT_RESTORE();
int32 sys_hal_global_int_enable(uint32 param)
{
	int32 ret = 0;

	return ret;
}

uint32 sys_hal_get_int_status(void)
{
#if CONFIG_SYS_CPU0
	return sys_ll_get_cpu0_int_0_31_status_value();
#else
	return sys_ll_get_cpu1_int_0_31_status_value();
#endif
}

__attribute__((section(".itcm_sec_code"))) uint32 sys_hal_get_int_group2_status(void)
{
#if CONFIG_SYS_CPU0
	return sys_ll_get_cpu0_int_32_63_status_value();
#else
	return sys_ll_get_cpu1_int_32_63_status_value();
#endif
}

/* REG_0x29:cpu0_int_32_63_status->cpu0_gpio_int_st: ,R,0x29[22]*/
uint32_t sys_hal_get_cpu0_gpio_int_st(void)
{
    return sys_ll_get_cpu0_int_32_63_status_cpu0_gpio_int_st();
}

