Sparkleiot/BK7239N_AT/middleware/soc/bk7236/hal/sys_hal.c
void sys_hal_set_cksel_pwm(uint32_t value)
{
    sys_hal_set_cksel_pwm0(value);
    sys_hal_set_cksel_pwm1(value);
}

uint32_t sys_hal_uart_select_clock_get(uart_id_t id)
{
    uint32_t ret = 0;

    switch(id)
    {
        case UART_ID_0:
        {
            ret = sys_ll_get_cpu_clk_div_mode1_clksel_uart0();
            break;
        }
        case UART_ID_1:
        {
            ret = sys_ll_get_cpu_clk_div_mode1_cksel_uart1();
            break;
        }
        case UART_ID_2:
        {
            ret = sys_ll_get_cpu_clk_div_mode1_cksel_uart1();
            break;
        }
        default:
            break;
    }

    ret = (!ret)?UART_SCLK_XTAL_26M:UART_SCLK_APLL;

    return ret;
}

uint32_t sys_hal_i2c_select_clock_get(i2c_id_t id)
{
	// i2c_clk switch not support
	return 0;
}

void sys_hal_sadc_int_enable(void)
{
    sys_hal_int_enable(SADC_INTERRUPT_CTRL_BIT);
}

void sys_hal_sadc_int_disable(void)
{
    sys_hal_int_disable(SADC_INTERRUPT_CTRL_BIT);
}

void sys_hal_sadc_pwr_up(void)
{
	sys_ll_set_cpu_device_clk_enable_sadc_cken(1);
	sys_ll_set_ana_reg2_gadc_nobuf_enable(1);
}

void sys_hal_sadc_pwr_down(void)
{
	sys_ll_set_ana_reg2_gadc_nobuf_enable(0);
	sys_ll_set_cpu_device_clk_enable_sadc_cken(0);
}

void sys_hal_set_saradc_config(void)
{
	sys_ll_set_ana_reg2_sp_nt_ctrl(0x3);
	sys_ll_set_ana_reg2_gadc_capcal(0);
	sys_ll_set_ana_reg2_gadc_nobuf_enable(0x1);
	sys_ll_set_ana_reg2_gadc_refbuf_ictrl(0x2);
	sys_ll_set_ana_reg2_gadc_inbuf_ictrl(0x2);
	sys_ll_set_ana_reg2_gadc_cmp_ictrl(0x2);
	// sys_ll_set_ana_reg2_xtalh_ctune(0x30);
}

void sys_hal_set_sdmadc_config(void)
{
	sys_ll_set_ana_reg2_sp_nt_ctrl(0x50);
	sys_ll_set_ana_reg2_gadc_capcal(0x4);
	sys_ll_set_ana_reg2_gadc_nobuf_enable(0x1);
	sys_ll_set_ana_reg2_gadc_refbuf_ictrl(0);
	sys_ll_set_ana_reg2_gadc_inbuf_ictrl(0);
	sys_ll_set_ana_reg2_gadc_cmp_ictrl(0);
	// sys_ll_set_ana_reg2_xtalh_ctune(0);
}

void sys_hal_set_clksel_spi0(uint32_t value)
{
    sys_ll_set_cpu_26m_wdt_clk_div_clksel_spi0(value);
}

void sys_hal_set_clksel_spi1(uint32_t value)
{
    sys_ll_set_cpu_26m_wdt_clk_div_clksel_spi1(value);
}

void sys_hal_set_clksel_spi(uint32_t value)
{
    if((SPI_CLK_SRC_XTAL == value) || (SPI_CLK_SRC_APLL == value))
    {
        sys_ll_set_cpu_26m_wdt_clk_div_clksel_spi0(value);
        sys_ll_set_cpu_26m_wdt_clk_div_clksel_spi1(value);
    }
    else
    {
        //os_printf("spi cksel is not support on BK7256 in function:%s, line:%d\n", __FUNCTION__, __LINE__);
    }

}

void sys_hal_en_tempdet(uint32_t value)
{
    sys_ll_set_ana_reg5_en_temp(value);
}

uint32_t sys_hal_mclk_mux_get(void)
{
	UINT32 ret = 0;

	ret = sys_ll_get_cpu_clk_div_mode1_cksel_core();

	return ret;
}

void sys_hal_mclk_mux_set(uint32_t value)
{
	sys_ll_set_cpu_clk_div_mode1_cksel_core(value);
}

uint32_t sys_hal_mclk_div_get(void)
{
	UINT32 ret = 0;

	ret = sys_ll_get_cpu_clk_div_mode1_clkdiv_core();

	return ret;
}

void sys_hal_mclk_div_set(uint32_t value)
{
	sys_ll_set_cpu_clk_div_mode1_clkdiv_core(value);
}

/**  Platform End **/




/**  BT Start **/
//BT
void sys_hal_bt_power_ctrl(bool power_up)
{
    if (power_up)
    {
        sys_ll_set_cpu_power_sleep_wakeup_pwd_btsp(0);
    }
    else
    {
        sys_ll_set_cpu_power_sleep_wakeup_pwd_btsp(1);
    }
}

void sys_hal_bt_clock_ctrl(bool en)
{
    if (en)
    {
        sys_ll_set_cpu_device_clk_enable_btdm_cken(1);
    }
    else
    {
        sys_ll_set_cpu_device_clk_enable_btdm_cken(0);
    }
}

void sys_hal_xvr_clock_ctrl(bool en)
{
    if (en)
    {
        sys_ll_set_cpu_device_clk_enable_xvr_cken(1);
    }
    else
    {
        sys_ll_set_cpu_device_clk_enable_xvr_cken(0);
    }
}

void sys_hal_btdm_interrupt_ctrl(bool en)
{
    if (en)
    {
        sys_ll_set_cpu0_int_32_63_en_cpu0_dm_irq_en(1);
            //TODO enable PLIC Int Enable Registers
    }
    else
    {
        sys_ll_set_cpu0_int_32_63_en_cpu0_dm_irq_en(0);
            //TODO disable PLIC Int Enable Registers
    }
}

void sys_hal_ble_interrupt_ctrl(bool en)
{
    if (en)
    {
        sys_ll_set_cpu0_int_32_63_en_cpu0_ble_irq_en(1);
            //TODO enable PLIC Int Enable Registers
    }
    else
    {
        sys_ll_set_cpu0_int_32_63_en_cpu0_ble_irq_en(0);
            //TODO disable PLIC Int Enable Registers
    }
}

void sys_hal_bt_interrupt_ctrl(bool en)
{
    if (en)
    {
        sys_ll_set_cpu0_int_32_63_en_cpu0_bt_irq_en(1);
            //TODO enable PLIC Int Enable Registers
    }
    else
    {
        sys_ll_set_cpu0_int_32_63_en_cpu0_bt_irq_en(0);
            //TODO disable PLIC Int Enable Registers
    }
}

void sys_hal_bt_rf_ctrl(bool en)
{
    if (en)
    {
        //todo
    }
    else
    {
        //todo
    }
}

void sys_hal_rf_ctrl(uint8_t type)
{
    if (type == RF_CTRL_PTA) {
        // rf ctrl by PTA
        sys_ll_set_cpu_storage_connect_op_select_rf_switch_en(0);
        sys_ll_set_cpu_storage_connect_op_select_rf_for_wifiorbt(0);
    } else if (type == RF_CTRL_WIFI) {
        // rf ctrl by Wi-Fi
        sys_ll_set_cpu_storage_connect_op_select_rf_for_wifiorbt(0);
        sys_ll_set_cpu_storage_connect_op_select_rf_switch_en(1);
    } else {
        // rf ctrl by BT
        sys_ll_set_cpu_storage_connect_op_select_rf_for_wifiorbt(1);
        sys_ll_set_cpu_storage_connect_op_select_rf_switch_en(1);
    }
}

uint8_t sys_hal_rf_ctrl_type_get(void)
{
    uint8_t type = 0;
    if (sys_ll_get_cpu_storage_connect_op_select_rf_switch_en()) {
        if (sys_ll_get_cpu_storage_connect_op_select_rf_for_wifiorbt()) {
            type = RF_CTRL_BT;
        } else {
            type = RF_CTRL_WIFI;
        }
    } else {
        type = RF_CTRL_PTA;
    }
    return type;
}

uint32_t sys_hal_bt_rf_status_get(void)
{
    //todo
    return 0;
}

void sys_hal_bt_sleep_exit_ctrl(bool en)
{
    if (en)
    {
        sys_ll_set_cpu_power_sleep_wakeup_bts_soft_wakeup_req(1);
    }
    else
    {
        sys_ll_set_cpu_power_sleep_wakeup_bts_soft_wakeup_req(0);
    }
}

void sys_hal_set_bts_wakeup_platform_en(bool value)
{
	/*TODO
	sys_ll_set_cpu_power_sleep_wakeup_bts_wakeup_platform_en(value);*/
	while(1){;}
}

uint32 sys_hal_get_bts_wakeup_platform_en()
{
	/*TODO
	sys_ll_get_cpu_power_sleep_wakeup_bts_wakeup_platform_en();*/
	while(1){;}
	return 0;
}

/**  BT End **/


/**  Audio Start **/
//Audio
/**  Audio End **/

