Sparkleiot/BK7239N_AT/middleware/soc/bk7236/hal/sys_hal.c
/**  Video Start **/
/**
  * @brief	lcd_disp  system config
  * param1: clk source sel 0:clk_320M      1:clk_480M,
  * param2: clk_div  F/(1+clkdiv_disp_l+clkdiv_disp_h*2)
  * param1: int_en eanble lcd cpu int
  * param2: clk_always_on, BUS_CLK ENABLE,0: bus clock open when module is select,1:bus clock always open,  0 by defult
  * return none
  */
void sys_hal_lcd_disp_clk_en(uint8_t clk_src_sel, uint8_t clk_div_l, uint8_t clk_div_h, uint8_t clk_always_on)
{
	sys_ll_set_cpu_clk_div_mode1_clkdiv_disp_l(clk_div_l);
	sys_ll_set_cpu_clk_div_mode2_clkdiv_disp_h(clk_div_h);
	sys_ll_set_cpu_clk_div_mode2_cksel_disp( clk_src_sel);
	sys_ll_set_cpu_device_clk_enable_disp_cken(1);
}

/**
  * @brief	lcd clk close and int disable, reg value recover default.
  * return none
  */
void sys_hal_lcd_disp_close(void)
{
	sys_ll_set_cpu_clk_div_mode1_clkdiv_disp_l(0);
	sys_ll_set_cpu_clk_div_mode2_clkdiv_disp_h(0);
	sys_ll_set_cpu_clk_div_mode2_cksel_disp(0);
	//sys_ll_set_cpu1_int_0_31_en_cpu1_lcd_int_en(&s_sys_hal, 1);
	//sys_ll_set_cpu0_int_0_31_en_cpu0_lcd_int_en(0);
	sys_ll_set_cpu_device_clk_enable_disp_cken(0);
	//sys_ll_set_cpu_mode_disckg2_disp_disckg(0);
}

/**
  * @brief	dma2d system config
  * param1: clk source sel 0:clk_320M	   1:clk_480M,
  * param2: clk_always_on  ENABLE,0: bus clock auto open when module is select,1:bus clock always open
  * param1: int_en eanble lcd cpu int
  * return none
  */
void sys_hal_dma2d_clk_en(uint8_t clk_always_on)
{
}

void sys_hal_set_jpeg_dec_disckg(uint32_t value)
{
}

/**  Video End **/

/**  WIFI Start **/
//WIFI

//Yantao Add Start
void sys_hal_modem_core_reset(void)
{
	//TODO, 7256 NO modem core reset
}

void sys_hal_mpif_invert(void)
{
	//TODO, 7256 NO mpif_invert
}

void sys_hal_modem_subsys_reset(void)
{
	//TODO, 7256 NO subsys reset
}
void sys_hal_mac_subsys_reset(void)
{
	//TODO, 7256 NO subsys reset
}
void sys_hal_usb_subsys_reset(void)
{
	//TODO, 7256 NO subsys reset
}
void sys_hal_dsp_subsys_reset(void)
{
	//TODO, 7256 NO subsys reset
}
void sys_hal_mac_power_ctrl(bool power_up)
{
	//WARNING:the low-level is power-down
	sys_ll_set_cpu_power_sleep_wakeup_pwd_wifp_mac(!(power_up));
}

void sys_hal_modem_power_ctrl(bool power_up)
{
	sys_ll_set_cpu_power_sleep_wakeup_pwd_wifp_phy(!(power_up));
}

void sys_hal_pta_ctrl(bool pta_en)
{
	//TODO, 7256 NO pta enable
}

__IRAM_SEC void sys_hal_modem_bus_clk_ctrl(bool clk_en)
{
	//TODO, 7256 no bus clock enable
}

__IRAM_SEC void sys_hal_modem_clk_ctrl(bool clk_en)
{
	sys_ll_set_cpu_device_clk_enable_phy_cken(clk_en);
}


void sys_hal_mac_bus_clk_ctrl(bool clk_en)
{
	//TODO, 7256 no bus clock enable
}

void sys_hal_mac_clk_ctrl(bool clk_en)
{
	sys_ll_set_cpu_device_clk_enable_mac_cken(clk_en);
}



void sys_hal_set_vdd_value(uint32_t param)
{
	sys_hal_ctrl_vdddig_h_vol(param);
}

uint32_t sys_hal_get_vdd_value(void)
{
	//TODO reg0x43 Write only
	return sys_ll_get_ana_reg9_vcorehsel();
}

//CMD_SCTRL_BLOCK_EN_MUX_SET
void sys_hal_block_en_mux_set(uint32_t param)
{
	//TODO 7256 no block en mux
}
void sys_hal_enable_mac_gen_int(void)
{
	sys_ll_set_cpu0_int_32_63_en_cpu0_wifi_mac_int_gen_en(1);
}
void sys_hal_enable_mac_prot_int(void)
{
	sys_ll_set_cpu0_int_32_63_en_cpu0_wifi_mac_int_prot_trigger_en(1);
}
void sys_hal_enable_mac_tx_trigger_int(void)
{
	sys_ll_set_cpu0_int_32_63_en_cpu0_wifi_mac_int_tx_trigger_en(1);
}
void sys_hal_enable_mac_rx_trigger_int(void)
{
	sys_ll_set_cpu0_int_32_63_en_cpu0_wifi_mac_int_rx_trigger_en(1);
}
void sys_hal_enable_mac_txrx_misc_int(void)
{
	sys_ll_set_cpu0_int_32_63_en_cpu0_wifi_mac_int_tx_rx_misc_en(1);
}
void sys_hal_enable_mac_txrx_timer_int(void)
{
	sys_ll_set_cpu0_int_0_31_en_cpu0_wifi_mac_int_tx_rx_timer_en(1);
}

void sys_hal_enable_modem_int(void)
{
	sys_ll_set_cpu0_int_0_31_en_cpu0_wifi_int_phy_mpb_en(1);
}
void sys_hal_enable_modem_rc_int(void)
{
	sys_ll_set_cpu0_int_0_31_en_cpu0_wifi_int_phy_riu_en(1);
}

void sys_hal_enable_hsu_int(void)
{
	sys_ll_set_cpu0_int_32_63_en_cpu0_wifi_hsu_irq_en(1);
}


void sys_hal_disable_hsu_int(void)
{
	sys_ll_set_cpu0_int_32_63_en_cpu0_wifi_hsu_irq_en(0);
}

void sys_hal_set_debug_mux(int type)
{
	sys_ll_set_sys_debug_config1_value(type);
}

void sys_hal_diag_debug_mac()
{
	sys_ll_set_sys_debug_config1_value(DIAG_DEBUG_MAC);
}

void sys_hal_diag_debug_phy()
{
	sys_ll_set_sys_debug_config1_value(DIAG_DEBUG_PHY);
}

void dbg_enable_debug_gpio(void)
{
	// 2 -> 9
	gpio_dev_unmap(GPIO_2);              // BK7256 EVB    BK7236 EVB      BIT
	gpio_dev_map(GPIO_2, GPIO_DEV_DEBUG0);   //CLK(H6)    CLK(H6)          0
	gpio_dev_unmap(GPIO_3);
	gpio_dev_map(GPIO_3, GPIO_DEV_DEBUG1);   //CMD(H6)    CMD(H6)          1
	gpio_dev_unmap(GPIO_4);
	gpio_dev_map(GPIO_4, GPIO_DEV_DEBUG2);   //D0(H6)     D0(H6)           2
	gpio_dev_unmap(GPIO_5);
	gpio_dev_map(GPIO_5, GPIO_DEV_DEBUG3);   //D1(H6)     D1(H6)           3
	gpio_dev_unmap(GPIO_6);
	gpio_dev_map(GPIO_6, GPIO_DEV_DEBUG4);   //CD(H6)     CD(H6)           4
	gpio_dev_unmap(GPIO_7);
	gpio_dev_map(GPIO_7, GPIO_DEV_DEBUG5);   //P7(H5)     P7(H5)           5
	gpio_dev_unmap(GPIO_8);
	gpio_dev_map(GPIO_8, GPIO_DEV_DEBUG6);   //P8(CON4)   P8(CON4)         6
	gpio_dev_unmap(GPIO_9);
	gpio_dev_map(GPIO_9, GPIO_DEV_DEBUG7);   //P9(CON4)   P9(CON4)         7

	// 14 -> 19
	gpio_dev_unmap(GPIO_14);
	gpio_dev_map(GPIO_14, GPIO_DEV_DEBUG8);  //P14(CON3)  P14(H3)          8
	gpio_dev_unmap(GPIO_15);
	gpio_dev_map(GPIO_15, GPIO_DEV_DEBUG9);  //P15(CON3)  P15(H3)          9
	gpio_dev_unmap(GPIO_16);
	gpio_dev_map(GPIO_16, GPIO_DEV_DEBUG10); //S14(H3)    P16(H3)         10
	gpio_dev_unmap(GPIO_17);
	gpio_dev_map(GPIO_17, GPIO_DEV_DEBUG11); //           P17(H3)         11
	gpio_dev_unmap(GPIO_18);
	gpio_dev_map(GPIO_18, GPIO_DEV_DEBUG12); //           P18(H5)         12
	gpio_dev_unmap(GPIO_19);
	gpio_dev_map(GPIO_19, GPIO_DEV_DEBUG13); //           P19(H5)         13

	// 24 -> 39
	gpio_dev_unmap(GPIO_24);
	gpio_dev_map(GPIO_24, GPIO_DEV_DEBUG14); //           P24(H8)         14
	gpio_dev_unmap(GPIO_25);
	gpio_dev_map(GPIO_25, GPIO_DEV_DEBUG15); //           P25(H8)         15
	gpio_dev_unmap(GPIO_26);
	gpio_dev_map(GPIO_26, GPIO_DEV_DEBUG16); //           P26(H8)         16
	gpio_dev_unmap(GPIO_27);
	gpio_dev_map(GPIO_27, GPIO_DEV_DEBUG17); //           MCLK(H14)       17
	gpio_dev_unmap(GPIO_28);
	gpio_dev_map(GPIO_28, GPIO_DEV_DEBUG18); //           P28/ADC4(H5)    18
	gpio_dev_unmap(GPIO_29);
	gpio_dev_map(GPIO_29, GPIO_DEV_DEBUG19); //           PCLK(H14)       19
	gpio_dev_unmap(GPIO_30);
	gpio_dev_map(GPIO_30, GPIO_DEV_DEBUG20); //           HSYNC(H14)      20
	gpio_dev_unmap(GPIO_31);
	gpio_dev_map(GPIO_31, GPIO_DEV_DEBUG21); //           VSYNC(H14)      21
	gpio_dev_unmap(GPIO_32);
	gpio_dev_map(GPIO_32, GPIO_DEV_DEBUG22); //           PXD0(H14)       22
	gpio_dev_unmap(GPIO_33);
	gpio_dev_map(GPIO_33, GPIO_DEV_DEBUG23); //           PXD1(H14)       23
	gpio_dev_unmap(GPIO_34);
	gpio_dev_map(GPIO_34, GPIO_DEV_DEBUG24); //           PXD2(H14)       24
	gpio_dev_unmap(GPIO_35);
	gpio_dev_map(GPIO_35, GPIO_DEV_DEBUG25); //           PXD3(H14)       25
	gpio_dev_unmap(GPIO_36);
	gpio_dev_map(GPIO_36, GPIO_DEV_DEBUG26); //           PXD4(H14)       26
	gpio_dev_unmap(GPIO_37);
	gpio_dev_map(GPIO_37, GPIO_DEV_DEBUG27); //           PXD5(H14)       27
	gpio_dev_unmap(GPIO_38);
	gpio_dev_map(GPIO_38, GPIO_DEV_DEBUG28); //           PXD6(H14)       28
	gpio_dev_unmap(GPIO_39);
	gpio_dev_map(GPIO_39, GPIO_DEV_DEBUG29); //           PXD7(H14)       29

	// 42 -> 43
	gpio_dev_unmap(GPIO_42);
	gpio_dev_map(GPIO_42, GPIO_DEV_DEBUG30); //           P42(CONN4)      30
	gpio_dev_unmap(GPIO_43);
	gpio_dev_map(GPIO_43, GPIO_DEV_DEBUG31); //           P43(CONN4)      31
}
//Yantao Add End

void sys_hal_cali_dpll_spi_trig_disable(void)
{
    sys_ll_set_ana_reg0_spitrig(0);
}

void sys_hal_cali_dpll_spi_trig_enable(void)
{
    sys_ll_set_ana_reg0_spitrig(1);
}

void sys_hal_cali_dpll_spi_detect_disable(void)
{
    sys_ll_set_ana_reg0_spideten(0);
}

void sys_hal_cali_dpll_spi_detect_enable(void)
{
    sys_ll_set_ana_reg0_spideten(1);
}

void sys_hal_set_xtalh_ctune(uint32_t value)
{
    sys_ll_set_ana_reg2_xtalh_ctune(value);
}

void sys_hal_analog_set(analog_reg_t reg, uint32_t value)
{
    uint32_t analog_reg_address;

