Sparkleiot/BK7239N_AT/middleware/soc/bk7236/hal/sys_hal.c
void sys_hal_psram_psldo_vsel(uint32_t value)
{
	sys_ll_set_ana_reg13_vpsramsel(value);// 1.8V + step 50mv
}

void sys_hal_psram_psldo_vset(uint32_t output_voltage, uint32_t is_add_200mv)
{
	// psldo_swb=1, vpsramsel=3 - 1.80v
	// psldo_swb=1, vpsramsel=2 - 1.85v
	// psldo_swb=1, vpsramsel=1 - 1.90v
	// psldo_swb=1, vpsramsel=0 - 1.95v
	// psldo_swb=0, vpsramsel=* - 3.00v
	sys_ll_set_ana_reg13_psldo_swb(output_voltage); //1-1.8v, 0-3.0v
	sys_ll_set_ana_reg13_vpsramsel(is_add_200mv);// 1.8V + step 50mv
}

void sys_hal_psram_psram_disckg(uint32_t value)
{
	// not support
}

/**  psram End **/

/* REG_0x03:cpu_storage_connect_op_select->flash_sel:0: normal flash operation 1:flash download by spi,R/W,0x3[9]*/
uint32_t sys_hal_get_cpu_storage_connect_op_select_flash_sel(void)
{
    return sys_ll_get_cpu_storage_connect_op_select_flash_sel();
}

void sys_hal_set_cpu_storage_connect_op_select_flash_sel(uint32_t value)
{
    sys_ll_set_cpu_storage_connect_op_select_flash_sel(value);
}

__IRAM_SEC void sys_hal_set_sys2flsh_2wire(uint32_t value)
{
	sys_ll_set_sys2flsh_2wire(value);
}

/** Ethernet start **/
#ifdef CONFIG_ETH
void sys_hal_enable_eth_int(uint32_t value)
{
    sys_ll_set_cpu0_int_32_63_en_cpu0_eth_int_en(value);
}
#endif
/** Ethernet End**/

/**  Misc Start **/
//Misc
/**  Misc End **/

void sys_hal_set_ana_trxt_tst_enable(uint32_t value)
{
}

void sys_hal_set_ana_scal_en(uint32_t value)
{
}

void sys_hal_set_ana_gadc_buf_ictrl(uint32_t value)
{
}

void sys_hal_set_ana_gadc_cmp_ictrl(uint32_t value)
{
}

void sys_hal_set_ana_pwd_gadc_buf(uint32_t value)
{
}

void sys_hal_set_ana_hres_sel0v9(uint32_t value)
{
    sys_ll_set_ana_reg3_hres_sel0v9(value);
}

void sys_hal_set_ana_vref_sel(uint32_t value)
{
	//sys_ll_set_ana_reg7_vref_sel(value);
}
void sys_hal_set_ana_cb_cal_manu(uint32_t value)
{
    sys_ll_set_ana_reg5_bcal_en(value);
}

void sys_hal_set_ana_cb_cal_trig(uint32_t value)
{
    sys_ll_set_ana_reg5_bcal_start(value);
}
void sys_hal_set_ana_vlsel_ldodig(uint32_t value)
{
    //sys_ll_set_ana_reg3_vlsel_ldodig(value);
}
void sys_hal_set_ana_vhsel_ldodig(uint32_t value)
{
    //sys_ll_set_ana_reg3_vhsel_ldodig(value);
}

void sys_hal_set_sdio_clk_en(uint32_t value)
{
	sys_ll_set_cpu_device_clk_enable_sdio_cken(value);
}

void sys_hal_set_cpu0_sdio_int_en(uint32_t value)
{
	sys_ll_set_cpu0_int_0_31_en_cpu0_sdio_int_en(value);
}

void sys_hal_set_cpu1_sdio_int_en(uint32_t value)
{
	sys_ll_set_cpu1_int_0_31_en_cpu1_sdio_int_en(value);
}

void sys_hal_set_sdio_clk_div(uint32_t value)
{
	sys_ll_set_cpu_clk_div_mode2_ckdiv_sdio(value);
}

uint32_t sys_hal_get_sdio_clk_div()
{
	return sys_ll_get_cpu_clk_div_mode2_ckdiv_sdio();
}

void sys_hal_set_sdio_clk_sel(uint32_t value)
{
	sys_ll_set_cpu_clk_div_mode2_cksel_sdio(value);
}

uint32_t sys_hal_get_sdio_clk_sel()
{
	return sys_ll_get_cpu_clk_div_mode2_cksel_sdio();
}


void sys_hal_set_ana_vctrl_sysldo(uint32_t value)
{
    //sys_ll_set_ana_reg5_vctrl_sysldo(value);
}

void sys_hal_set_yuv_buf_clock_en(uint32_t value)
{
	sys_ll_set_reserver_reg0xd_yuv_cken(value);
}

void sys_hal_set_h264_clock_en(uint32_t value)
{
	sys_ll_set_reserver_reg0xd_h264_cken(value);
}

void sys_hal_nmi_wdt_set_clk_div(uint32_t value)
{
	sys_ll_set_cpu_26m_wdt_clk_div_ckdiv_wdt(value);
}

__IRAM_SEC uint32_t sys_hal_nmi_wdt_get_clk_div(void)
{
	return sys_ll_get_cpu_26m_wdt_clk_div_ckdiv_wdt();
}


void sys_hal_set_ana_cb_cal_manu_val(uint32_t value)
{
    sys_ll_set_ana_reg5_vbias(value);
}

void sys_hal_set_ana_reg11_apfms(uint32_t value) {
	sys_ll_set_ana_reg11_apfms(value);
}

void sys_hal_set_ana_reg12_dpfms(uint32_t value) {
	sys_ll_set_ana_reg12_dpfms(value);
}

static void sys_hal_delay(volatile uint32_t times)
{
        while(times--);
}

uint32_t sys_hal_cali_dpll(uint32_t param)
{
    sys_hal_cali_dpll_spi_trig_disable();

    if (!param)
    {
        sys_hal_delay(120);
    }
    else
    {
        sys_hal_delay(60);
    }

    sys_hal_cali_dpll_spi_trig_enable();
    sys_hal_cali_dpll_spi_detect_disable();

    if (!param)
    {
        sys_hal_delay(3400);
    }
    else
    {
        sys_hal_delay(340);
    }

	sys_hal_cali_dpll_spi_detect_enable();

    if (!param)
    {
        sys_hal_delay(3400);
    }
    else
    {
        sys_hal_delay(340);
    }

    return BK_OK;
}
static void sys_hal_dpll_cpu_flash_time_early_init(uint32_t chip_id)
{
	uint32_t coresel = 0;
	uint32_t corediv = 0;
	//zhangheng20231018: calibrate dpll before use
	/*0x2:320M, 0X3:480M*/
	coresel = sys_ll_get_cpu_clk_div_mode1_cksel_core();
	corediv = sys_ll_get_cpu_clk_div_mode1_clkdiv_core();
	if((coresel != PM_CLKSEL_CORE_320M) || (coresel != PM_CLKSEL_CORE_480M))
	{
		sys_hal_cali_dpll(0);
	}

	if (((chip_id & PM_CHIP_ID_MASK) == (PM_CHIP_ID_MPW_V2_3 & PM_CHIP_ID_MASK))
	|| ((chip_id & PM_CHIP_ID_MASK) == (PM_CHIP_ID_MPW_V4 & PM_CHIP_ID_MASK))) {
		sys_hal_flash_set_clk(0x2);
	} else {
		/*default of MP flash 80M = 480/6*/
		if(sys_ll_get_cpu_clk_div_mode2_cksel_flash() != PM_CLKSEL_FLASH_480M)
		{
			if(sys_ll_get_cpu_clk_div_mode2_ckdiv_flash() != 0x1)// 480/6
			{
				sys_ll_set_cpu_clk_div_mode2_ckdiv_flash(0x1);
			}
			sys_hal_flash_set_clk(PM_CLKSEL_FLASH_480M);
		}
	}

	/* clk_divd 120MHz,
	 * 1, the core clock is depended on CONFIG_CPU_FREQ_HZ and configSYSTICK_CLOCK_HZ.
	 *    Pay attention to bk_pm_module_vote_cpu_freq,and the routine will switch core
	 *    clock;
	 * 2, sysTick module's clock source is processor clock now;
	 */
	if((coresel != PM_CLKSEL_CORE_320M) && (corediv != 0x1))//160M
	{
		sys_hal_mclk_div_set(480000000/CONFIG_CPU_FREQ_HZ - 1);
		sys_hal_delay(10000);

		sys_hal_mclk_mux_set(0x3);/*clock source: DPLL, 480M*/
	}
	timer_hal_us_init();

	/*increase the anaspi_freq, current it only use for lpo: external 32k, 26m/32k*/
	//if(bk_clk_32k_customer_config_get() != PM_LPO_SRC_ROSC)
	{
		sys_ll_set_cpu_anaspi_freq_anaspi_freq(0x2);//ana_sck = bus_clk/((divd+1)*2))
	}
}
static void sys_hal_pwd_rosc()
{
	uint32_t chip_id = aon_pmu_hal_get_chipid();
	volatile uint32_t count = PM_POWER_ON_ROSC_STABILITY_TIME;

	if ((chip_id & PM_CHIP_ID_MASK) == (PM_CHIP_ID_MP_A & PM_CHIP_ID_MASK))
	{
		/*when the lpo src select external 32k or 26m/32k, it disable the rosc;because make sure write the analog register successfully*/
		if(bk_clk_32k_customer_config_get() != PM_LPO_SRC_ROSC)
		{
			if(aon_pmu_ll_get_r41_lpo_config() == PM_LPO_SRC_ROSC)
			{
				aon_pmu_ll_set_r41_lpo_config(PM_LPO_SRC_DIVD);
			}

			if(sys_ll_get_ana_reg5_pwd_rosc_spi() != 0x1)
			{
				sys_ll_set_ana_reg5_pwd_rosc_spi(0x1);
			}
		}
		else
		{
			if(sys_ll_get_ana_reg5_pwd_rosc_spi() != 0x0)
			{
				sys_ll_set_ana_reg5_pwd_rosc_spi(0x0);

				while(count--)//delay time for stability when power on rosc
				{
				}
			}
		}
	}
	else
	{
		if(sys_ll_get_ana_reg5_pwd_rosc_spi() != 0x0)
		{
			sys_ll_set_ana_reg5_pwd_rosc_spi(0x0);

			while(count--)//delay time for stability when power on rosc
			{
			}
		}
	}

