Sparkleiot/BK7239N_AT/middleware/soc/bk7236/hal/sys_hal.c
}
//TODO the module owner can put the sys init to better place
void sys_hal_early_init(void)
{
	/*power down rosc, temp modify*/
	sys_hal_pwd_rosc();

	uint32_t chip_id = aon_pmu_hal_get_chipid();

	uint32_t val = sys_hal_analog_get(ANALOG_REG5);
	val &= ~(0x1 << 13); // power up apll then power down to reinit after deep sleep
	val |= (0x1 << 5) | (0x1 << 3) | (0x1 << 2);
	sys_hal_analog_set(ANALOG_REG5,val);
	//donghui20230504: 0:1/7 1:1/5 2:1/3 3:1/1
	sys_ll_set_ana_reg5_adc_div(1); //tenglong20230627 adc_div=1/5 since volt of GPIO <= 3.3V
	sys_ll_set_ana_reg5_pwdaudpll(1);

	val = sys_hal_analog_get(ANALOG_REG0);
	val |= (0x13 << 20) ;
	sys_hal_analog_set(ANALOG_REG0,val);

	sys_hal_analog_set(ANALOG_REG0, 0xF1305B56);  //zhangheng20231020 <0>=0 pdll test disalbe for safe
	sys_ll_set_ana_reg0_dsptrig(1);
	sys_ll_set_ana_reg0_dsptrig(0);

	sys_hal_analog_set(ANALOG_REG2, 0x7E003450); //wangjian20221110 xtal=0x50
	//sys_ll_set_cpu_device_clk_enable_value(0x0c008084);
	sys_hal_analog_set(ANALOG_REG3, 0xC5F00B88);

	/**
	 * attention:
	 * SPI latch must be enable before ana_reg[8~13] modification
	 * and don't forget disable it after that.
	 */
	sys_ll_set_ana_reg9_spi_latch1v(1);
	if ((chip_id & PM_CHIP_ID_MASK) == (PM_CHIP_ID_MPW_V2_3 & PM_CHIP_ID_MASK)) {
		sys_hal_analog_set(ANALOG_REG8, 0x57E62FFE);
	} else {
		sys_hal_analog_set(ANALOG_REG8, 0x57E62F26);//shuguang20230414[8:3]7->4: for evm
	}
	//tenglong20231113: <8:5>=5 <3:0>=4 keep GPIO5/4 pullup when powerup
	sys_hal_analog_set(ANALOG_REG9, 0x787BC8A4); //tenglong20231017: revert <15> to 1 for softstart, should not change it
	if ((chip_id & PM_CHIP_ID_MASK) == (PM_CHIP_ID_MPW_V2_3 & PM_CHIP_ID_MASK)) {
		sys_hal_analog_set(ANALOG_REG10, 0xC35543C7);//tenglong20230417:rosc config for buck in lowpower
		sys_hal_analog_set(ANALOG_REG11, 0x9FEF31F7);
		sys_hal_analog_set(ANALOG_REG12, 0x9F03EF6F);
		sys_hal_analog_set(ANALOG_REG13, 0x1F6FB3FF);
	} else if ((chip_id & PM_CHIP_ID_MASK) == (PM_CHIP_ID_MPW_V4 & PM_CHIP_ID_MASK)) {
		sys_hal_analog_set(ANALOG_REG10, 0xC35543C7);//tenglong20230417:rosc config for buck in lowpower
		sys_hal_analog_set(ANALOG_REG11, 0x977EB9FF);
		sys_hal_analog_set(ANALOG_REG12, 0x977ECA4A);
		sys_hal_analog_set(ANALOG_REG13, 0x547AB0F5);
	} else if ((chip_id & PM_CHIP_ID_MASK) == (PM_CHIP_ID_MP_A & PM_CHIP_ID_MASK)){
		sys_hal_analog_set(ANALOG_REG10, 0xC35543C7);//tenglong20230417:rosc config for buck in lowpower
		//default of MP
		//tenglong20231017: SYS_reg0x4B<3:0>=8,SYS_reg0x4C<3:0>=0,SYS_reg0x4D<4:1>=7 for softstart
		sys_hal_analog_set(ANALOG_REG11, 0x907EB878);
		sys_hal_analog_set(ANALOG_REG12, 0x907ECA40);
		sys_hal_analog_set(ANALOG_REG13, 0x727070EE);//tenglong20231020 disable psram/update volt for safe
		sys_hal_analog_set(ANALOG_REG25, 0x961FAA4);

		sys_ll_set_ana_reg3_inbufen0v9(1);
	} else if (((chip_id & PM_CHIP_ID_MASK) == (PM_CHIP_ID_MP_I & PM_CHIP_ID_MASK))||((chip_id & PM_CHIP_ID_MASK) == (PM_CHIP_ID_MP_J & PM_CHIP_ID_MASK))){
		sys_hal_analog_set(ANALOG_REG10, 0xC3D543E7);//tenglong20240123
		//default of MP
		//tenglong20231017: SYS_reg0x4B<3:0>=8,SYS_reg0x4C<3:0>=0,SYS_reg0x4D<4:1>=7 for softstart
		/*EVM optimize: Update the buck configuration as follows:
        system0X4B<27:24> change from 4 to 0.This configuration change applies only to I and J versions.*/
		sys_hal_analog_set(ANALOG_REG11, 0xB07E99F8);//tenglong20240418
		sys_hal_analog_set(ANALOG_REG12, 0xB47ECF20);//tenglong20240418
		sys_hal_analog_set(ANALOG_REG13, 0x727070EE);//tenglong20231020 disable psram/update volt for safe
		sys_hal_analog_set(ANALOG_REG25, 0x961FAA4);

		sys_ll_set_ana_reg3_inbufen0v9(1);
	} else {
		sys_hal_analog_set(ANALOG_REG10, 0xC3D543A7);//tenglong20240123
		//default of MP
		//tenglong20231017: SYS_reg0x4B<3:0>=8,SYS_reg0x4C<3:0>=0,SYS_reg0x4D<4:1>=7 for softstart
		sys_hal_analog_set(ANALOG_REG11, 0xB47E99F8);//tenglong20240418
		sys_hal_analog_set(ANALOG_REG12, 0xB47ECF20);//tenglong20240418
		sys_hal_analog_set(ANALOG_REG13, 0x727070EE);//tenglong20231020 disable psram/update volt for safe
		sys_hal_analog_set(ANALOG_REG25, 0x961FAA4);

		sys_ll_set_ana_reg3_inbufen0v9(1);

	}
	sys_ll_set_ana_reg9_spi_latch1v(0);

	/*early init cpu flash time*/
	sys_hal_dpll_cpu_flash_time_early_init(chip_id);
}

/**  SCR Start  */

void sys_hal_set_7816_int_en(uint32_t value)
{
#if CONFIG_SYS_CPU0
	sys_ll_set_cpu0_int_32_63_en_cpu0_7816_int_en(value);
#else
	sys_ll_set_cpu1_int_32_63_en_cpu1_7816_int_en(value);
#endif
}

void sys_hal_set_scr_clk(uint32_t value)
{
	sys_ll_set_reserver_reg0xd_scr_cken(value);
}

#define FLASH_DPLL_CLK    120    // 120MHz
#define CLK_XTAL    26    // 26MHz


void sys_hal_set_flash_clk(uint32_t flash_clk)
{
	uint32_t flash_max_clk = FLASH_DPLL_CLK;
	uint32_t calculated_div = flash_max_clk / flash_clk;
	uint32_t flash_div = 0;

	if (flash_clk <= CLK_XTAL) {
		sys_ll_set_cpu_clk_div_mode2_cksel_flash(0);
	} else {
		sys_ll_set_cpu_clk_div_mode2_cksel_flash(1);
		if (calculated_div <= 4) {          //0:/4  1:/6  2:/8  3:/10，it is invalid when cksel_flash=0
			flash_div = 0;
		} else if (calculated_div <= 6) {
			flash_div = 1;
		} else if (calculated_div <= 8) {
			flash_div = 2;
		} else {
			flash_div = 3;
		}
		sys_ll_set_cpu_clk_div_mode2_ckdiv_flash(flash_div);
	}
}

void sys_hal_set_cpu_clk(uint32_t cpu_clk)
{
	if (cpu_clk <= CLK_XTAL) {
		sys_hal_switch_cpu_bus_freq(PM_CPU_FRQ_XTAL);
	} else if (cpu_clk <= 60) {
		sys_hal_switch_cpu_bus_freq(PM_CPU_FRQ_60M);
	} else if (cpu_clk <= 80) {
		sys_hal_switch_cpu_bus_freq(PM_CPU_FRQ_80M);
	} else if (cpu_clk <= 120) {
		sys_hal_switch_cpu_bus_freq(PM_CPU_FRQ_120M);
	} else if (cpu_clk <= 160) {
		sys_hal_switch_cpu_bus_freq(PM_CPU_FRQ_160M);
	} else {
		sys_hal_switch_cpu_bus_freq(PM_CPU_FRQ_240M);
	}
}
/**  SCR End  */
